Repository: ArlysthonFeitosa/BMI-Check
Catalog: bmi_check/lib/app/shared/l10n/app_*.arb
Languages: de, es, fr, hi, it, ja, pt, ru, zh

# language
source: English
de: Deutsch
es: Español
fr: Français
hi: हिंदी
it: Italiano
ja: 日本
pt: Português
ru: Русский
zh: 普通话

# titleIntroPage1
source: Welcome to BMI Check
de: Willkommen bei BMI Check
es: Bienvenido(a) a IMC Check
fr: Bienvenue sur IMC Check
hi: आईएमसी जाँच में आपका स्वागत है
it: Benvenuto(a) a IMC Check
ja: BMIチェックへようこそ
pt: Bem-vindo(a) ao IMC Check
ru: Добро пожаловать в ИМТ Check
zh: 欢迎使用 IMC Check

# bodyIntroPage1
source: Discover if you have the ideal weight and body mass index in a simple and fast way and share with your friends
de: Finden Sie heraus, ob Sie einen idealen Body-Mass-Index auf einfache und schnelle Weise haben und teilen Sie ihn mit Ihren Freunden
es: Descubre de manera sencilla y rápida si tienes el peso ideal y el índice de masa corporal, y comparte con tus amigos
fr: Découvrez de manière simple et rapide si vous avez le poids idéal et l'indice de masse corporelle, et partagez-le avec vos amis
hi: एक सरल और त्वरित तरीके से जानें कि क्या आपका शरीर का मास अंश आदर्श है और अपने दोस्तों के साथ साझा करें।
it: Scopri in modo semplice e veloce se hai un indice di massa corporea ideale e condividilo con i tuoi amici.
ja: 簡単で素早い方法で理想的な体重指数を知り、友達と共有しましょう。
pt: Descubra se você tem o índice de massa corporal ideal em uma maneira simples e rápida e compartilhe com seus amigos
ru: Узнайте, имеете ли вы идеальный индекс массы тела простым и быстрым способом, и поделитесь с друзьями
zh: 快速简便地发现自己的身体质量指数是否理想，并与朋友分享

# titleIntroPage2
source: Fill the Data
de: Füllen Sie die Daten aus
es: Rellena los datos
fr: Remplissez les données
hi: डेटा भरें
it: Compila i dati
ja: データを入力してください
pt: Preencha os dados
ru: Заполните данные
zh: 填写资料

# bodyIntroPage2
source: Fill the custom fields of body weight, height, sex and age for BMI Check to calculate your bmi
de: Füllen Sie die personalisierten Felder für Körpergewicht, Größe, Geschlecht und Alter aus, damit IMC Check Ihren BMI berechnen kann
es: Rellena los campos personalizados de peso corporal, altura, sexo y edad para que el IMC Check calcule tu IMC
fr: Remplissez les champs personnalisés de poids corporel, de taille, de sexe et d'âge pour que IMC Check calcule votre IMC
hi: आपके वजन, ऊंचाई, लिंग और आयु के व्यक्तिगत क्षेत्रों को भरें ताकि आईएमसी जाँच आपका आईएमसी गणना कर सके।
it: Compila i campi personalizzati del peso corporeo, altezza, sesso e età per permettere a IMC Check di calcolare il tuo IMC.
ja: 体重、身長、性別、年齢などの個人情報を入力して、IMCチェックがあなたの体重指数を計算します。
pt: Preencha os campos personalizados de peso corporal, altura, sexo e idade para que o IMC Check calcule seu imc
ru: Заполните пользовательские поля веса, роста, пола и возраста, чтобы IMC Check рассчитал ваш индекс массы тела
zh: 填写个人的体重、身高、性别和年龄等自定义字段，以便IMC Check计算您的BMI。

# titleIntroPage3
source: Increase your Health
de: Verbessern Sie Ihre Gesundheit
es: Mejora tu Salud
fr: Améliorez votre santé
hi: अपने स्वास्थ्य को बेहतर बनाएं
it: Migliora la tua salute
ja: 健康を維持しましょう
pt: Melhore sua Saúde
ru: Улучшите своё здоровье
zh: 改善健康

# bodyIntroPage3
source: Use the final result to increase your own health and keep the ideal body mass index
de: Verwenden Sie das Endergebnis, um Ihre eigene Gesundheit zu verbessern und den idealen Body-Mass-Index zu halten
es: Utiliza el resultado final para mejorar tu propia salud y mantener el índice de masa corporal ideal
fr: Utilisez le résultat final pour améliorer votre propre santé et maintenir l'indice de masse corporelle idéal
hi: अंतिम परिणाम का उपयोग अपने स्वास्थ्य को बेहतर बनाने और आईएमसी आदर्श बनाए रखने के लिए करें।
it: Usa il risultato finale per migliorare la tua salute e mantenere il tuo indice di massa corporea ideale.
ja: 最終結果を利用して、自分の健康を改善し、理想的な体重指数を維持しましょう。
pt: Use o resultado final para melhorar sua própria saúde e manter o índice de massa corporal ideal
ru: Используйте итоговый результат, чтобы улучшить своё здоровье и поддерживать идеальный индекс массы тела
zh: 使用最终的结果来改善自己的健康，并保持理想的身体质量指数。

source: Skip
de: Überspringen
es: Saltar
fr: Sauter
hi: छोड़ें
it: Salta
ja: スキップ
pt: Pular
ru: Пропустить
zh: 跳过

# getStartedButton
source: Get Started
de: Starten
es: Empezar
fr: Commencer
hi: शुरू करें
it: Inizia
ja: はじめる
pt: Começar
ru: Начать
zh: 开始

# appTitle
source: BMI Check
es: IMC Check
fr: IMC Check
hi: आईएमसी जाँच
it: IMC Check
ja: BMIチェック
pt: IMC Check
ru: ИМТ Check
zh: IMC Check

# selectSexPrompt
source: Select your sex
de: Wählen Sie Ihr Geschlecht aus
es: Selecciona tu sexo
fr: Sélectionnez votre sexe
hi: अपना लिंग चुनें
it: Seleziona il tuo sesso
ja: 性別を選択してください
pt: Selecione o seu sexo
ru: Выберите свой пол
zh: 选择您的性别

# feminineSex
source: Feminine
de: Weiblich
es: Femenino
fr: Féminin
hi: महिला
it: Femminile
ja: 女性
pt: Feminino
ru: Женский
zh: 女性

# masculineSex
source: Masculine
de: Männlich
es: Masculino
fr: Masculin
hi: पुरुष
it: Maschile
ja: 男性
pt: Masculino
ru: Мужской
zh: 男性

# selectHeightPrompt
source: Select your height in
de: Wählen Sie Ihre Größe aus
es: Selecciona tu altura en
fr: Sélectionnez votre taille en
hi: अपनी ऊंचाई का चयन करें
it: Seleziona la tua altezza in
ja: 身長を選択してください
pt: Selecione sua altura em
ru: Выберите свой рост в
zh: 选择您的身高单位

source: {heightMetric}:
hi: {heightMetric} में:

source: Age
de: Alter
es: Edad
fr: Âge
hi: उम्र
it: Età
ja: 年齢
pt: Idade
ru: Возраст
zh: 年龄

source: Weight
de: Gewicht
es: Peso
fr: Poids
hi: वजन
it: Peso
ja: 体重
pt: Peso
ru: Вес
zh: 体重

# calculateButton
source: Calculate
de: Berechnen
es: Calcular
fr: Calculer
hi: गणना करें
it: Calcola
ja: 計算する
pt: Calcular
ru: Рассчитать
zh: 计算

# unselectedSexException
source: Choose your sex
de: Wählen Sie ein Geschlecht aus
es: Elige un sexo
fr: Choisissez un sexe
hi: लिंग चुनें
it: Scegli un sesso
ja: 性別を選択してください
pt: Escolha um sexo
ru: Выберите пол
zh: 请选择性别

# emptyAgeException
source: Insert a valid age
de: Geben Sie ein gültiges Alter ein
es: Ingresa una edad válida
fr: Entrez un âge valide
hi: एक वैध उम्र दर्ज करें
it: Inserisci un'età valida
ja: 有効な年齢を入力してください
pt: Insira uma idade válida
ru: Введите правильный возраст
zh: 请输入有效的年龄

# emptyWeightException
source: Insert a valid weight
de: Geben Sie ein gültiges Gewicht ein
es: Ingresa un peso válido
fr: Entrez un poids valide
hi: एक वैध वजन दर्ज करें
it: Inserisci un peso valido
ja: 有効な体重を入力してください
pt: Insira um peso válido
ru: Введите правильный вес
zh: 请输入有效的体重

# nullAgeException
source: Insert a valid age
de: Geben Sie ein gültiges Alter ein
es: Ingresa una edad válida
fr: Entrez un âge valide
hi: एक वैध उम्र दर्ज करें
it: Inserisci un'età valida
ja: 有効な年齢を入力してください
pt: Insira uma idade válida
ru: Введите правильный возраст
zh: 请输入有效的年龄

# overAgeLimitException
source: The age must be under 120
de: Das Alter muss unter 120 liegen
es: La edad debe ser menor a 120
fr: L'âge doit être inférieur à 120
hi: आयु 120 से कम होनी चाहिए
it: L'età deve essere inferiore a 120
ja: 年齢は120歳以下でなければなりません
pt: A idade deve estar abaixo de 120
ru: Возраст должен быть менее 120
zh: 年龄应该低于120岁

# underAgeLimitException
source: The age must be over 0
de: Das Alter muss über 0 liegen
es: La edad debe ser mayor a 0
fr: L'âge doit être supérieur à 0
hi: आयु 0 से अधिक होनी चाहिए
it: L'età deve essere superiore a 0
ja: 年齢は0歳以上でなければなりません
pt: A idade deve estar acima de 0
ru: Возраст должен быть более 0
zh: 年龄应该高于0岁

# nullHeightException
source: Insert a valid height
de: Geben Sie eine gültige Größe ein
es: Ingresa una altura válida
fr: Entrez une taille valide
hi: एक वैध ऊंचाई दर्ज करें
it: Inserisci un'altezza valida
ja: 有効な身長を入力してください
pt: Insira uma altura válida
ru: Введите правильный рост
zh: 请输入有效的身高

# overHeightLimitException
source: The height must be under {maxHeight}
de: Die Größe muss unter {maxHeight} liegen
es: La altura debe ser menor a {maxHeight}
fr: La taille doit être inférieure à {maxHeight}
hi: ऊंचाई {maxHeight} से कम होनी चाहिए
it: L'altezza deve essere inferiore a {maxHeight}
ja: 身長は{maxHeight}以下でなければなりません
pt: A altura deve estar abaixo de {maxHeight}
ru: Рост должен быть меньше {maxHeight}
zh: 身高应低于{maxHeight}

# underHeightLimitException
source: The height must be over {minHeight}
de: Die Größe muss über {minHeight} liegen
es: La altura debe ser mayor a {minHeight}
fr: La taille doit être supérieure à {minHeight}
hi: ऊंचाई {minHeight} से अधिक होनी चाहिए
it: L'altezza deve essere superiore a {minHeight}
ja: 身長は{minHeight}以上でなければなりません
pt: A altura deve estar acima de {minHeight}
ru: Рост должен быть больше {minHeight}
zh: 身高应高于{minHeight}

# nullWeightException
source: Insert a valid weight
de: Geben Sie ein gültiges Gewicht ein
es: Ingresa un peso válido
fr: Entrez un poids valide
hi: एक वैध वजन दर्ज करें
it: Inserisci un peso valido
ja: 有効な体重を入力してください
pt: Insira um peso válido
ru: Введите правильный вес
zh: 请输入有效的体重

# overWeightLimitException
source: The weight must be under {maxWeight}
de: Das Gewicht muss unter {maxWeight} liegen
es: El peso debe ser menor a {maxWeight}
fr: Le poids doit être inférieur à {maxWeight}
hi: वजन {maxWeight} से कम होना चाहिए
it: Il peso deve essere inferiore a {maxWeight}
ja: 体重は{maxWeight}以下でなければなりません
pt: O peso deve estar abaixo de {maxWeight}
ru: Вес должен быть меньше {maxWeight}
zh: 体重应低于{maxWeight}

# underWeightLimitException
source: The weight must be over 0
de: Das Gewicht muss über 0 liegen
es: El peso debe ser mayor a 0
fr: Le poids doit être supérieur à 0
hi: वजन 0 से अधिक होना चाहिए
it: Il peso deve essere superiore a 0
ja: 体重は0以上でなければなりません
pt: O peso deve estar acima de 0
ru: Вес должен быть больше 0
zh: 体重应高于0

# idealResultTitle
source: Ideal BMI
de: Idealer BMI
es: IMC Ideal
fr: IMC Idéal
hi: आईएमसी आदर्श
it: IMC Ideale
ja: 理想的なBMI
pt: IMC Ideal
ru: Идеальный ИМТ
zh: 理想BMI

# idealResultDescription
source: You have the ideal body mass index. In this case, there is harmony between weight and height, that is, with regard to food and health, the person has made correct choices. That's because a balanced diet and enough exercise help keep in shape. We recommend you to keep a healthy lifestyle...
de: Sie haben den idealen Body-Mass-Index. In diesem Fall herrscht Harmonie zwischen Gewicht und Größe, das heißt, in Bezug auf Ernährung und Gesundheit hat die Person die richtigen Entscheidungen getroffen. Eine ausgewogene Ernährung und ausreichend Bewegung helfen dabei, die Form zu halten. Wir empfehlen, dass Sie einen gesunden Lebensstil beibehalten...
es: Tienes el índice de masa corporal ideal. En este caso, hay armonía entre peso y altura, es decir, en cuanto a alimentación y salud, la persona hizo elecciones correctas. Esto se debe a que una dieta equilibrada y mucho ejercicio ayudan a mantenerse en forma. Te recomendamos mantener un estilo de vida saludable...
fr: Vous avez l'indice de masse corporelle idéal. Dans ce cas, il y a harmonie entre le poids et la taille, c'est-à-dire que la personne a fait des choix alimentaires et de santé corrects. C'est parce qu'un régime équilibré et beaucoup d'exercice aident à maintenir la forme. Nous vous recommandons de maintenir un mode de vie sain...
hi: आपका शारीरिक मास आदर्श है। इस मामले में, वजन और ऊंचाई के बीच समंवेदना होती है, अर्थात खाने-पीने और स्वास्थ्य से संबंधित व्यक्ति सही चुनाव करता है। यह इसलिए है क्योंकि एक संतुलित आहार और पर्याप्त व्यायाम फिट रहने में मदद करते हैं। हम आपको एक स्वस्थ जीवन शैली बनाए रखने की सलाह देते हैं...
it: Hai un indice di massa corporea ideale. In questo caso, c'è un'armonia tra peso ed altezza, ovvero la persona ha fatto scelte corrette per quanto riguarda alimentazione e salute. Ciò perché una dieta bilanciata e molto esercizio fisico aiutano a mantenersi in forma. Ti consigliamo di mantenere uno stile di vita sano...
ja: あなたのBMIは理想的です。つまり、体重と身長の調和がとれており、食事と健康に関して正しい選択をした人です。バランスのとれた食事と十分な運動が体型を維持するのに役立つため、それが理由です。 健康的なライフスタイルを維持することをお勧めします...
pt: Você tem o índice de massa corporal ideal. Nesse caso, há harmonia entre peso e altura, ou seja, no que diz respeito à alimentação e à saúde, a pessoa fez escolhas corretas. Isso porque uma dieta balanceada e bastante exercício ajudam a manter a forma. Recomendamos que você mantenha um estilo de vida saudável...
ru: У вас идеальный индекс массы тела. В этом случае вес и рост гармонично сочетаются, то есть, касательно питания и здоровья, вы сделали правильный выбор. Это потому, что сбалансированное питание и достаточное количество физических упражнений помогают сохранять форму. Мы рекомендуем вам поддерживать здоровый образ жизни...
zh: 您拥有理想的身体质量指数。在这种情况下，体重和身高之间存在和谐，也就是说，关于饮食和健康方面，人们做出了正确的选择。这是因为均衡的饮食和大量的运动有助于保持身材。我们建议您保持健康的生活方式...

# underWeightResultTitle
source: Underweight
de: Untergewicht
es: Bajo de Peso
fr: Sous-poids
hi: वजन कम
it: Sotto Peso
ja: 低体重
pt: Abaixo do Peso
ru: Недостаточный вес
zh: 体重过轻

# underWeightResultDescription
source: You are underweight! This index can be caused by a voluntary decision, such as food deprivation, or eating behavior disorders, such as anorexia and bulimia. In addition, can be caused by metabolic diseases, parasites, inflammatory bowel diseases, food intolerances or psychic factors, such as stress. We recommend you to search a nutritionist...
de: Sie sind untergewichtig! Dieser Index kann durch eine freiwillige Entscheidung wie Nahrungsentzug oder durch Essstörungen wie Anorexie und Bulimie verursacht werden. Außerdem kann er durch Stoffwechselkrankheiten, Parasiten, entzündliche Darmerkrankungen, Nahrungsmittelunverträglichkeiten oder psychische Faktoren wie Stress verursacht werden. Wir empfehlen, dass Sie sich an einen Ernährungsberater wenden...
es: ¡Estás por debajo del peso! Este índice puede ser causado por una decisión voluntaria, como la privación alimentaria, o por trastornos del comportamiento alimentario, como la anorexia y la bulimia. Además, puede ser causada por enfermedades metabólicas, parásitos, enfermedades inflamatorias intestinales, intolerancias alimentarias o factores psíquicos, como el estrés. Te recomendamos buscar a un nutricionista...
fr: Vous êtes en dessous du poids! Cet indice peut être causé par une décision volontaire, telle que la privation alimentaire, ou par des troubles du comportement alimentaire tels que l'anorexie et la boulimie. De plus, cela peut être causé par des maladies métaboliques, des parasites, des maladies inflammatoires de l'intestin, des intolérances alimentaires ou des facteurs psychologiques tels que le stress. Nous vous recommandons de consulter un nutritionniste...
hi: आप कमजोरी से अधिक पीछे हैं! यह सूचकांक एक स्वेच्छा निर्णय, जैसे भोजन की अनावश्यकता, या खाद्य व्यवहार विकार जैसे अनोरेक्सिया और बुलिमिया जैसे बिमारियों द्वारा हो सकता है। इसके अलावा, यह मेटाबोलिक रोगों, कीटाणु, संवेदनशील आहार की असहिष्णुता या तनाव जैसे मनोवैज्ञानिक कारकों द्वारा भी हो सकता है। हम आपको एक पोषणविद तलाशने की सलाह देते हैं...
it: Sei sotto peso! Questo indice può essere causato da una decisione volontaria, come la privazione alimentare, o da disturbi del comportamento alimentare, come anoressia e bulimia. Inoltre, può essere causato da malattie metaboliche, parassiti, malattie infiammatorie intestinali, intolleranze alimentari o fattori psicologici, come lo stress. Ti consigliamo di consultare un nutrizionista...
ja: あなたは低体重です！この指数は、食事制限などの自発的な決定、拒食症や過食症などの食行動障害、代謝性疾患、寄生虫、炎症性腸疾患、食物アレルギー、ストレスなどの心理的要因によって引き起こされる場合があります。 栄養士に相談することをお勧めします...
pt: Você está abaixo do peso! Esse índice pode ser causado por uma decisão voluntária, como a privação alimentar, ou por distúrbios do comportamento alimentar, como anorexia e bulimia. Além disso, pode ser causada por doenças metabólicas, parasitas, doenças inflamatórias intestinais, intolerâncias alimentares ou fatores psíquicos, como estresse. Recomendamos que procure um nutricionista...
ru: Вы недостаточно питаетесь! Этот индекс может быть вызван как добровольным решением, например, голоданием, так и нарушениями поведения в питании, такими как анорексия и булимия. Кроме того, причиной может быть метаболические заболевания, паразиты, воспалительные заболевания кишечника, пищевые непереносимости или психологические факторы, такие как стресс. Мы рекомендуем обратиться к диетологу...
zh: 您的体重过轻！这个指数可能是由自愿的决定，如饥饿，或饮食行为障碍，如厌食症和贪食症引起的。此外，它也可能是由代谢性疾病、寄生虫、肠道炎症、食物不耐受或心理因素如压力引起的。我们建议您去找一位营养师...

# overWeightResultTitle
source: Overweight
de: Übergewicht
es: Sobrepeso
fr: En surpoids
hi: अधिक वजन
it: Sopra Peso
ja: 肥満
pt: Acima do Peso
ru: Избыточный вес
zh: 体重超标

# overWeightResultDescription
source: You are overweight. Being overweight means having more weight than is considered a normal or healthy weight for your age or size. Although an overweight person carries excess weight, he may or may not have excessive fat accumulation. However, you will always be above your ideal weight. We recommend you to add more healthy habits in your lifestyle.
de: Sie haben Übergewicht. Übergewicht bedeutet, dass Sie mehr Gewicht haben als für Ihr Alter oder Ihre Größe als normal oder gesund angesehen wird. Obwohl eine Person mit Übergewicht überschüssiges Gewicht trägt, kann sie oder er nicht unbedingt zu viel Fett haben. Aber Sie werden immer über Ihrem Idealgewicht sein. Wir empfehlen, dass Sie mehr gesunde Gewohnheiten in Ihren Lebensstil integrieren.
es: Estás por encima del peso. Estar por encima del peso significa tener más peso del que se considera un peso normal o saludable para tu edad o tamaño. Aunque una persona con sobrepeso lleva exceso de peso, puede o no tener acumulación excesiva de grasa. Sin embargo, siempre estarás por encima de tu peso ideal. Recomendamos que añadas más hábitos saludables a tu estilo de vida.
fr: Vous êtes en surpoids. Être en surpoids signifie avoir plus de poids que ce qui est considéré comme un poids normal ou sain pour votre âge ou votre taille. Bien qu'une personne en surpoids porte un excès de poids, elle peut ou non avoir une accumulation excessive de graisse. Cependant, vous serez toujours au-dessus de votre poids idéal. Nous vous recommandons d'adopter des habitudes plus saines dans votre mode de vie.
hi: आप अधिक वजन से ग्रसित हैं। अधिक वजन होना अपनी आयु या आकार के लिए सामान्य या स्वस्थ माना जाने वाले वजन से अधिक वजन रखना होता है। हालांकि, एक व्यक्ति जो अधिक वजन रखता है, उसमें अतिरिक्त वजन होता है या नहीं होता है। हम आपको अपने जीवन शैली में अधिक स्वस्थ आदतों को जोड़ने की सलाह देते हैं।
it: Sei sovrappeso. Essere sovrappeso significa avere un peso superiore a quello considerato normale o sano per la propria età o taglia. Anche se una persona in sovrappeso porta un peso eccessivo, potrebbe o non potrebbe avere un accumulo eccessivo di grasso. Comunque, sarete sempre sopra il vostro peso ideale. Vi consigliamo di aggiungere più abitudini salutari al vostro stile di vita.
ja: あなたは肥満です。肥満は、年齢やサイズに対して正常な体重または健康的な体重よりも重量が多いことを意味します。過体重の人は、過剰な脂肪を持っているかもしれないし、持っていないかもしれませんが、常に自分の理想体重よりも重いです。 より健康的な習慣を生活に取り入れることをお勧めします。
pt: Você está acima do peso. Estar acima do peso significa ter mais peso do que é considerado um peso normal ou saudável para sua idade ou tamanho. Embora uma pessoa com sobrepeso carregue excesso de peso, ela pode ou não ter acúmulo excessivo de gordura. Porém, você sempre estará acima do seu peso ideal. Recomendamos que você adicione mais hábitos saudáveis ​​ao seu estilo de vida.
ru: Вы имеете избыточный вес. Иметь избыточный вес означает иметь больше веса, чем считается нормальным или здоровым для вашего возраста или размера. Хотя у человека с избыточным весом есть лишний вес, он может или не может иметь чрезмерное скопление жира. Однако вы всегда будете иметь избыточный вес. Мы рекомендуем добавить больше здоровых привычек в свой образ жизни.
zh: 您的体重超标了。体重超标意味着体重比您的年龄或大小被认为是正常或健康的重量还要多。虽然超重的人携带的重量过多，但他们可能有或没有过多的脂肪积累。然而，您总是会超出自己的理想体重。我们建议您加入更多的健康习惯到您的生活中。

# obesity1ResultTitle
source: Grade 1 of Obesity
de: Grad 1 der Fettleibigkeit
es: Grado 1 de Obesidad
fr: Obésité de grade 1
hi: मोटापा ग्रेड 1
it: Grado 1 di Obesità
ja: 肥満度1
pt: Grau 1 de Obesidade
ru: 1 степень ожирения
zh: 肥胖1级

# obesity1ResultDescription
source: Obesity is associated with several complications in different body systems. The following can be cited: type 2 diabetes mellitus due to high glucose; gestational diabetes; cholesterol diseases, systemic arterial hypertension; heart diseases; sleep apnea; liver diseases; some types of cancer, anxiety and depression; among others. We recommend you to search a nutritionist...
de: Fettleibigkeit ist mit verschiedenen Komplikationen in verschiedenen Körpersystemen verbunden. Dazu gehören Typ-2-Diabetes aufgrund hoher Glukose, Schwangerschaftsdiabetes, Cholesterinerkrankungen, systemische Hypertonie, Herzkrankheiten, Schlafapnoe, Lebererkrankungen, einige Krebsarten, Angstzustände und Depressionen, unter anderem. Wir empfehlen, dass Sie sich an einen Ernährungsberater wenden...
es: La obesidad está asociada a varias complicaciones en diferentes sistemas del cuerpo. Se pueden mencionar: diabetes mellitus tipo 2 por glucosa elevada, diabetes gestacional, enfermedades del colesterol, hipertensión arterial sistémica, enfermedades cardíacas, apnea del sueño, enfermedades del hígado, algunos tipos de cáncer, ansiedad y depresión, entre otros. Recomendamos que consultes a un nutricionista...
fr: L'obésité est associée à plusieurs complications dans différents systèmes corporels. On peut citer : le diabète de type 2 causé par une glycémie élevée ; le diabète gestationnel ; les maladies du cholestérol ; l'hypertension artérielle systémique ; les maladies cardiaques ; l'apnée du sommeil ; les maladies du foie ; certains types de cancer, l'anxiété et la dépression ; entre autres. Nous vous recommandons de consulter un nutritionniste...
hi: मोटापा विभिन्न शरीर के प्रणालियों में कई जटिलताओं से जुड़ा हुआ है। उनमें डायबिटीज मेलिटस के टाइप 2, उच्च ग्लूकोज के कारण; गर्भावस्था डायबिटीज; कोलेस्ट्रॉल के रोग, उच्च रक्तचाप; हृदय रोग; नींद में आवाज का बंद हो जाना; लिवर के रोग; कुछ कैंसर के प्रकार, चिंता और अवसाद; आदि शामिल हैं। हम आपको एक पोषण विशेषज्ञ की तलाश करने की सलाह देते हैं...
it: L'obesità è associata a varie complicazioni in diversi sistemi del corpo. Possono essere menzionati: diabete mellito tipo 2 per elevati livelli di glucosio; diabete gestazionale; malattie del colesterolo, ipertensione arteriosa sistemica; malattie cardiache; apnea del sonno; malattie del fegato; alcuni tipi di cancro, ansia e depressione; tra gli altri. Vi consigliamo di consultare un nutrizionista...
ja: 肥満は、さまざまな身体系の合併症に関連しています。高血糖による2型糖尿病、妊娠糖尿病、コレステロール疾患、高血圧、心疾患、睡眠時無呼吸症候群、肝疾患、一部のがん、不安やうつ病などが挙げられます。 栄養士に相談することをお勧めします...
pt: A obesidade está associada a várias complicações em diferentes sistemas do corpo. Podem ser citados: diabetes melito tipo 2 por glicose elevada; diabetes gestacional; doenças do colesterol, hipertensão arterial sistêmica; doenças cardíacas; apnéia do sono; doenças do fígado; alguns tipos de câncer, ansiedade e depressão; entre outros. Recomendamos que procure um nutricionista...
ru: Ожирение ассоциируется с различными осложнениями в разных системах организма. К ним могут относиться: сахарный диабет 2 типа из-за повышенного уровня глюкозы; беременный диабет; заболевания холестерина, системная артериальная гипертензия; заболевания сердца; сонная апноэ; заболевания печени; некоторые виды рака, тревога и депрессия; и многие другие. Мы рекомендуем обратиться к диетологу...
zh: 肥胖与身体的不同系统中的许多并发症有关。这些可以包括高血糖的2型糖尿病，妊娠糖尿病，胆固醇疾病，高血压，心脏病，睡眠呼吸暂停，肝病，某些类型的癌症，焦虑和抑郁等。我们建议您去找一位营养师...

# obesity2ResultTitle
source: Grade 2 of Obesity
de: Grad 2 der Fettleibigkeit
es: Grado 2 de Obesidad
fr: Obésité de grade 2
hi: मोटापा दर्जा 2
it: Grado 2 di Obesità
ja: 肥満度2
pt: Grau 2 de Obesidade
ru: 2 степень ожирения
zh: 肥胖2级
