Repository: ArlysthonFeitosa/BMI-Check
Catalog: bmi_check/lib/app/shared/l10n/app_*.arb
Languages: de, es, fr, hi, it, ja, pt, ru, zh

# obesity2ResultDescription
source: Obesity is associated with several complications in different body systems. The following can be cited: type 2 diabetes mellitus due to high glucose; gestational diabetes; cholesterol diseases, systemic arterial hypertension; heart diseases; sleep apnea; liver diseases; some types of cancer, anxiety and depression; among others. We recommend you to search a nutritionist...
de: Fettleibigkeit ist mit verschiedenen Komplikationen in verschiedenen Körpersystemen verbunden. Dazu gehören Typ-2-Diabetes aufgrund hoher Glukose, Schwangerschaftsdiabetes, Cholesterinerkrankungen, systemische Hypertonie, Herzkrankheiten, Schlafapnoe, Lebererkrankungen, einige Krebsarten, Angstzustände und Depressionen, unter anderem. Wir empfehlen, dass Sie sich an einen Ernährungsberater wenden...
es: La obesidad está asociada a varias complicaciones en diferentes sistemas del cuerpo. Se pueden mencionar: diabetes mellitus tipo 2 por glucosa elevada, diabetes gestacional, enfermedades del colesterol, hipertensión arterial sistémica, enfermedades cardíacas, apnea del sueño, enfermedades del hígado, algunos tipos de cáncer, ansiedad y depresión, entre otros. Recomendamos que consultes a un nutricionista...
fr: L'obésité est associée à plusieurs complications dans différents systèmes corporels. On peut citer : le diabète de type 2 causé par une glycémie élevée ; le diabète gestationnel ; les maladies du cholestérol ; l'hypertension artérielle systémique ; les maladies cardiaques ; l'apnée du sommeil ; les maladies du foie ; certains types de cancer, l'anxiété et la dépression ; entre autres. Nous vous recommandons de consulter un nutritionniste...
hi: मोटापा विभिन्न शरीर के प्रणालियों में कई जटिलताओं से जुड़ा हुआ है। उनमें डायबिटीज मेलिटस के टाइप 2, उच्च ग्लूकोज के कारण; गर्भावस्था डायबिटीज; कोलेस्ट्रॉल के रोग, उच्च रक्तचाप; हृदय रोग; नींद में आवाज का बंद हो जाना; लिवर के रोग; कुछ कैंसर के प्रकार, चिंता और अवसाद; आदि शामिल हैं। हम आपको एक पोषण विशेषज्ञ की तलाश करने की सलाह देते हैं...
it: L'obesità è associata a varie complicazioni in diversi sistemi del corpo. Possono essere menzionati: diabete mellito tipo 2 per elevati livelli di glucosio; diabete gestazionale; malattie del colesterolo, ipertensione arteriosa sistemica; malattie cardiache; apnea del sonno; malattie del fegato; alcuni tipi di cancro, ansia e depressione; tra gli altri. Vi consigliamo di consultare un nutrizionista...
ja: 肥満は、身体のさまざまなシステムで多くの合併症と関連しています。以下が挙げられます：高血糖による2型糖尿病、妊娠糖尿病、コレステロール疾患、高血圧、心臓疾患、睡眠時無呼吸症候群、肝疾患、がんの一部、不安やうつ病など。栄養士に相談することをお勧めします...
pt: A obesidade está associada a várias complicações em diferentes sistemas do corpo. Podem ser citados: diabetes melito tipo 2 por glicose elevada; diabetes gestacional; doenças do colesterol, hipertensão arterial sistêmica; doenças cardíacas; apnéia do sono; doenças do fígado; alguns tipos de câncer, ansiedade e depressão; entre outros. Recomendamos que procure um nutricionista...
ru: Ожирение ассоциируется с множеством осложнений в разных системах организма. К ним относятся: сахарный диабет 2 типа из-за повышенного уровня глюкозы; гестационный диабет; заболевания холестерина, системная артериальная гипертензия; сердечно-сосудистые заболевания; апноэ сна; заболевания печени; некоторые виды рака, тревога и депрессия; и многое другое. Мы рекомендуем обратиться к диетологу...
zh: 肥胖与身体的不同系统中的多种并发症有关，例如：高血糖引起的2型糖尿病；妊娠糖尿病；胆固醇疾病、高血压；心脏疾病；睡眠呼吸暂停；肝脏疾病；某些类型的癌症、焦虑和抑郁症等等。 我们建议您咨询一位营养师......

# obesity3ResultTitle
source: Grade 3 of Obesity
de: Grad 3 der Fettleibigkeit
es: Grado 3 de Obesidad
fr: Obésité de grade 3
hi: मोटापा दर्जा 3
it: Grado 3 di Obesità
ja: 肥満度3
pt: Grau 3 de Obesidade
ru: Степень 3 Ожирения
zh: 肥胖3级

# obesity3ResultDescription
source: Obesity is associated with several complications in different body systems. The following can be cited: type 2 diabetes mellitus due to high glucose; gestational diabetes; cholesterol diseases, systemic arterial hypertension; heart diseases; sleep apnea; liver diseases; some types of cancer, anxiety and depression; among others. We recommend you to search a nutritionist...
de: Fettleibigkeit ist mit verschiedenen Komplikationen in verschiedenen Körpersystemen verbunden. Dazu gehören Typ-2-Diabetes aufgrund hoher Glukose, Schwangerschaftsdiabetes, Cholesterinerkrankungen, systemische Hypertonie, Herzkrankheiten, Schlafapnoe, Lebererkrankungen, einige Krebsarten, Angstzustände und Depressionen, unter anderem. Wir empfehlen, dass Sie sich an einen Ernährungsberater wenden...
es: La obesidad está asociada a varias complicaciones en diferentes sistemas del cuerpo. Se pueden mencionar: diabetes mellitus tipo 2 por glucosa elevada, diabetes gestacional, enfermedades del colesterol, hipertensión arterial sistémica, enfermedades cardíacas, apnea del sueño, enfermedades del hígado, algunos tipos de cáncer, ansiedad y depresión, entre otros. Recomendamos que consultes a un nutricionista...
fr: L'obésité est associée à plusieurs complications dans différents systèmes corporels. On peut citer : le diabète de type 2 causé par une glycémie élevée ; le diabète gestationnel ; les maladies du cholestérol ; l'hypertension artérielle systémique ; les maladies cardiaques ; l'apnée du sommeil ; les maladies du foie ; certains types de cancer, l'anxiété et la dépression ; entre autres. Nous vous recommandons de consulter un nutritionniste...
hi: ओबेसिटी शरीर के विभिन्न प्रणालियों में कई जटिलताओं से जुड़ी होती है। इसमें निम्नलिखित शामिल हैं: उच्च रक्तशर्म द्वारा डायबिटीज मेलिटस के प्रकार 2, गर्भावस्था में डायबिटीज, कोलेस्ट्रॉल और हार्ट संबंधी बीमारियां, नींद में अविराम, लिवर रोग, कुछ प्रकार के कैंसर, चिंता और अवसाद। हम एक पोषण विशेषज्ञ की तलाश करने की सलाह देते हैं...
it: L'obesità è associata a varie complicazioni in diversi sistemi del corpo. Possono essere menzionati: diabete mellito tipo 2 per elevati livelli di glucosio; diabete gestazionale; malattie del colesterolo, ipertensione arteriosa sistemica; malattie cardiache; apnea del sonno; malattie del fegato; alcuni tipi di cancro, ansia e depressione; tra gli altri. Vi consigliamo di consultare un nutrizionista...
ja: 肥満は、身体のさまざまなシステムで多くの合併症と関連しています。以下が挙げられます：高血糖による2型糖尿病、妊娠糖尿病、コレステロール疾患、高血圧、心臓疾患、睡眠時無呼吸症候群、肝疾患、がんの一部、不安やうつ病など。栄養士に相談することをお勧めします...
pt: A obesidade está associada a várias complicações em diferentes sistemas do corpo. Podem ser citados: diabetes melito tipo 2 por glicose elevada; diabetes gestacional; doenças do colesterol, hipertensão arterial sistêmica; doenças cardíacas; apnéia do sono; doenças do fígado; alguns tipos de câncer, ansiedade e depressão; entre outros. Recomendamos que procure um nutricionista...
ru: Ожирение ассоциируется с множеством осложнений в разных системах организма. К ним относятся: сахарный диабет 2 типа из-за повышенного уровня глюкозы; гестационный диабет; заболевания холестерина, системная артериальная гипертензия; сердечно-сосудистые заболевания; апноэ сна; заболевания печени; некоторые виды рака, тревога и депрессия; и многое другое. Мы рекомендуем обратиться к диетологу...
zh: 肥胖与身体的不同系统中的多种并发症有关，例如：高血糖引起的2型糖尿病；妊娠糖尿病；胆固醇疾病、高血压；心脏疾病；睡眠呼吸暂停；肝脏疾病；某些类型的癌症、焦虑和抑郁症等等。 我们建议您咨询一位营养师......

# idealWeightText
source: PS: Your ideal weight is between {lowerIdealWeightLimit} and {upperIdealWeightLimit}
de: PS: Ihr ideales Gewicht liegt zwischen {lowerIdealWeightLimit} und {upperIdealWeightLimit}
es: PD: Su peso ideal está entre {lowerIdealWeightLimit} y {upperIdealWeightLimit}
fr: PS: Votre poids idéal se situe entre {lowerIdealWeightLimit} et {upperIdealWeightLimit}
hi: पीएस: आपका आदर्श वजन {lowerIdealWeightLimit} और {upperIdealWeightLimit} के बीच है
it: PS: Il tuo peso ideale si trova tra {lowerIdealWeightLimit} e {upperIdealWeightLimit}
ru: Примечание: ваш идеальный вес находится в диапазоне между {lowerIdealWeightLimit} и {upperIdealWeightLimit}

# shareButton
source: Share
de: Teilen
es: Compartir
fr: Partager
hi: साझा करें
it: Condividi
ja: 共有する
pt: Compartilhar
ru: Поделиться
zh: 分享

# shareText
source: Look at my BMI! You can check yours in BMI Check!
de: Schau dir meinen BMI an! Du kannst deinen im BMI Check überprüfen!
es: ¡Mira mi IMC! ¡Puedes verificar el tuyo en IMC Check!
fr: Regardez mon IMC ! Vous pouvez vérifier le vôtre sur IMC Check!
hi: मेरा आईएमसी देखो! आप अपना आईएमसी चेक कर सकते हैं IMC चेक में!
it: Guarda il mio IMC! Puoi controllare il tuo su IMC Check!
ja: 私のBMIを見てください！あなたはIMCチェックであなた自身のものをチェックすることができます！
pt: Olha o meu IMC! Você pode checar o seu no IMC Check!
ru: Взгляните на мой ИМТ! Вы можете проверить свой в IMC Check!
zh: 看看我的BMI！您可以在BMI检测中检查您的BMI！

# settingsPageTitle
source: Settings
de: Einstellungen
es: Configuraciones
fr: Paramètres
hi: सेटिंग्स
it: Impostazioni
ja: 設定
pt: Configurações
ru: Настройки
zh: 设置

# heightMetricsListTile
source: Height Metrics
de: Höhenmaße
es: Unidades de Altura
fr: Métriques de Hauteur
hi: ऊंचाई मेट्रिक्स
it: Metriche di Altezza
ja: 身長のメトリックス
pt: Métricas de Altura
ru: Метрики Роста
zh: 高度单位

# heightSettingsPageTitle
source: Height Metrics Settings
de: Höhenmaße
es: Unidades de Altura
fr: Métriques de Hauteur
hi: ऊंचाई मेट्रिक्स
it: Metriche di Altezza
ja: 身長のメト リックス
pt: Métricas de Altura
ru: Метрики Роста
zh: 高度单位

# heightSettingsPageTile1
source: Feet (ft)
de: Fuß (ft)
es: Pies (ft)
fr: Pieds (ft)
hi: फीट (ft)
it: Piedi (ft)
ja: フィート (ft)
pt: Pés (ft)
ru: Футы (ft)
zh: 英尺 （ft）

# heightSettingsPageTile2
source: Inches (in)
de: Zoll (in)
es: Pulgadas (in)
fr: Pouces (in)
hi: इंच (in)
it: Pollici (in)
ja: インチ (in)
pt: Polegadas (in)
ru: Дюймы (in)
zh: 英寸 （in）

# heightSettingsPageTile3
source: Meters (m)
de: Meter (m)
es: Metros (m)
fr: Mètres (m)
hi: मीटर (m)
it: Metri (m)
ja: メートル (m)
pt: Metros (m)
ru: Метры (m)
zh: 米 （m）

# heightSettingsPageTile4
source: Centimeters (cm)
de: Zentimeter (cm)
es: Centímetros (cm)
fr: Centimètres (cm)
hi: सेंटीमीटर (cm)
it: Centimetri (cm)
ja: センチメートル (cm)
pt: Centímetros (cm)
ru: Сантиметры (cm)
zh: 厘米 （cm）

# weightMetricsListTile
source: Weight Metrics
de: Gewichtsmaße
es: Unidades de Peso
fr: Métriques de Poids
hi: वजन मेट्रिक्स
it: Metriche di Peso
ja: 体重のメトリックス
pt: Métricas de Peso
ru: Метрики Веса
zh: 重量单位

# weightSettingsPageTitle
source: Weight Metrics Settings
de: Gewichtsmaße
es: Unidades de Peso
fr: Métriques de Poids
hi: वजन मेट्रिक्स
it: Metriche di Peso
ja: 体重のメト リックス
pt: Métricas de Peso
ru: Метрики Веса
zh: 重量单位

# weightSettingsTile1
source: Pounds (lb)
de: Pfund (lb)
es: Libras (lb)
fr: Livres (lb)
hi: पाउंड (lb)
it: Libbre (lb)
ja: ポンド (lb)
pt: Libras (lb)
ru: Фунты (lb)
zh: 磅 （lb）

# weightSettingsTile2
source: Kilograms (kg)
de: Kilogramm (kg)
es: Kilogramos (kg)
fr: Kilogrammes (kg)
hi: किलोग्राम (kg)
it: Chilogrammi (kg)
ja: キログラム (kg)
pt: Kilogramas (kg)
ru: Килограммы (kg)
zh: 千克 （kg）

# languageSettingsListTile
source: Language
de: Sprache
es: Idioma
fr: Langue
hi: भाषा
it: Lingua
ja: 言語
pt: Idioma
ru: Язык
zh: 语言

# languageSettingsPageTitle
source: Language
de: Sprache
es: Idioma
fr: Langue
hi: भाषा
it: Lingua
ja: 言語
pt: Idioma
ru: Язык
zh: 语言

# themeSettingsListTile
source: Theme
de: Thema
es: Tema
fr: Thème
hi: थीम
it: Tema
ja: テーマ
pt: Tema
ru: Тема
zh: 主题

# themeSettingsPageTitle
source: Theme Settings
de: Thema
es: Tema
fr: Thème
hi: थीम
it: Tema
ja: テーマ
pt: Tema
ru: Тема
zh: 主题

# pageTileSystemDefault
source: System Default
de: Systemstandard
es: Configuración del sistema
fr: Paramètres du système
hi: सिस्टम डिफ़ॉल्ट
it: Impostazioni predefinite di sistema
ru: Системная тема по умолчанию
zh: 系统默认

# themeSettingsPageTile2
source: Light Theme
de: Helles Thema
es: Tema Claro
fr: Thème Clair
hi: उज्ज्वल थीम
it: Tema Chiaro
ja: ダークテーマ
pt: Tema Escuro
ru: Светлая тема
zh: 浅色主题

# themeSettingsPageTile3
source: Dark Theme
de: Dunkles Thema
es: Tema Obscuro
fr: Thème Foncé
hi: डार्क थीम
it: Tema Scuro
ru: Темная тема
zh: 深色主题
